Ran Plan for dir: `terraform/atlantis` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # kubernetes_secret.tls-vpn has been changed
~ resource "kubernetes_secret" "tls-vpn" {
      ~ data      = (sensitive value)
        id        = "pritunl/wayofthesys-com-vpn-tls"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              + "cert-manager.io/alt-names"        = "vpn.wayofthesys.com"
              + "cert-manager.io/certificate-name" = "wayofthesys-com-vpn-tls"
              + "cert-manager.io/common-name"      = "vpn.wayofthesys.com"
              + "cert-manager.io/ip-sans"          = ""
              + "cert-manager.io/issuer-group"     = "cert-manager.io"
              + "cert-manager.io/issuer-kind"      = "ClusterIssuer"
              + "cert-manager.io/issuer-name"      = "zerossl"
              + "cert-manager.io/uri-sans"         = ""
            }
            name             = "wayofthesys-com-vpn-tls"
          ~ resource_version = "30647494" -> "30648155"
            # (4 unchanged attributes hidden)
        }
    }
  # kubernetes_secret.loki-tls has been changed
~ resource "kubernetes_secret" "loki-tls" {
        id        = "default/wayofthesys-com-loki-tls"
        # (3 unchanged attributes hidden)

      ~ metadata {
          + annotations      = {}
          + labels           = {}
            name             = "wayofthesys-com-loki-tls"
            # (4 unchanged attributes hidden)
        }
    }
  # kubernetes_secret.tls has been changed
~ resource "kubernetes_secret" "tls" {
      ~ data      = (sensitive value)
        id        = "pritunl/wayofthesys-com-pritunl-tls"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              + "cert-manager.io/alt-names"        = "pritunl.wayofthesys.com"
              + "cert-manager.io/certificate-name" = "wayofthesys-com-pritunl-tls"
              + "cert-manager.io/common-name"      = "pritunl.wayofthesys.com"
              + "cert-manager.io/ip-sans"          = ""
              + "cert-manager.io/issuer-group"     = "cert-manager.io"
              + "cert-manager.io/issuer-kind"      = "ClusterIssuer"
              + "cert-manager.io/issuer-name"      = "zerossl"
              + "cert-manager.io/uri-sans"         = ""
            }
            name             = "wayofthesys-com-pritunl-tls"
          ~ resource_version = "30647495" -> "30648363"
            # (4 unchanged attributes hidden)
        }
    }
  # kubernetes_ingress.loki_cluster_ingress["wayofthesys.com"] has been changed
~ resource "kubernetes_ingress" "loki_cluster_ingress" {
        id     = "default/wayofthesys.com-loki-ingress"
      ~ status = [
          ~ {
              ~ load_balancer = [
                  ~ {
                      ~ ingress = [
                          + {
                              + hostname = ""
                              + ip       = "161.35.142.184"
                            },
                        ]
                    },
                ]
            },
        ]

      ~ metadata {
          + labels           = {}
            name             = "wayofthesys.com-loki-ingress"
          ~ resource_version = "30647496" -> "30647740"
            # (4 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubernetes_secret.loki-tls will be updated in-place
~ resource "kubernetes_secret" "loki-tls" {
      ~ data      = (sensitive value)
        id        = "default/wayofthesys-com-loki-tls"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_secret.tls will be updated in-place
~ resource "kubernetes_secret" "tls" {
      ~ data      = (sensitive value)
        id        = "pritunl/wayofthesys-com-pritunl-tls"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "cert-manager.io/alt-names"        = "pritunl.wayofthesys.com" -> null
              - "cert-manager.io/certificate-name" = "wayofthesys-com-pritunl-tls" -> null
              - "cert-manager.io/common-name"      = "pritunl.wayofthesys.com" -> null
              - "cert-manager.io/ip-sans"          = "" -> null
              - "cert-manager.io/issuer-group"     = "cert-manager.io" -> null
              - "cert-manager.io/issuer-kind"      = "ClusterIssuer" -> null
              - "cert-manager.io/issuer-name"      = "zerossl" -> null
              - "cert-manager.io/uri-sans"         = "" -> null
            }
            name             = "wayofthesys-com-pritunl-tls"
            # (5 unchanged attributes hidden)
        }
    }

  # kubernetes_secret.tls-vpn will be updated in-place
~ resource "kubernetes_secret" "tls-vpn" {
      ~ data      = (sensitive value)
        id        = "pritunl/wayofthesys-com-vpn-tls"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "cert-manager.io/alt-names"        = "vpn.wayofthesys.com" -> null
              - "cert-manager.io/certificate-name" = "wayofthesys-com-vpn-tls" -> null
              - "cert-manager.io/common-name"      = "vpn.wayofthesys.com" -> null
              - "cert-manager.io/ip-sans"          = "" -> null
              - "cert-manager.io/issuer-group"     = "cert-manager.io" -> null
              - "cert-manager.io/issuer-kind"      = "ClusterIssuer" -> null
              - "cert-manager.io/issuer-name"      = "zerossl" -> null
              - "cert-manager.io/uri-sans"         = "" -> null
            }
            name             = "wayofthesys-com-vpn-tls"
            # (5 unchanged attributes hidden)
        }
    }

  # tls_cert_request.request must be replaced
-/+ resource "tls_cert_request" "request" {
      ~ cert_request_pem = <<-EOT
            -----BEGIN CERTIFICATE REQUEST-----
            MIIDIDCCAggCAQAwNTERMA8GA1UEChMIQXRsYW50aXMxIDAeBgNVBAMTF3ByaXR1
            bmwud2F5b2Z0aGVzeXMuY29tMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKC
            AQEA5lJDYAk0g4CxkJCu6amgCAZ2ISd7rvsuvGJNP+h/BS/6N1VtDxuNm/kVkUGR
            HJ+hjgDI8h0c8B9V5zJsQVf/vohlYFDfzysiME0hwejyXiaPaeSMX0VZRUqVGBNG
            08/MIwGncogGau8Rk5zXoF7tBHjIPMlU5oNorLS95Mfl5FqC/Uz2kARNBcPPPpbp
            gkb9aJymPgIQf9cmIqXqlXQesNMueCyLlXNgy6k9uaLE4TlihNUhUOhKppT+Oi/j
            KCY+tsv5+utzopPimJeb90E+5froxRAjKMlJ0MW+0DHTqsZD2gnmPwnaRZ73wma3
            rZMmUCrWdgNCA2cov/hSRUy8GwIDAQABoIGlMIGiBgkqhkiG9w0BCQ4xgZQwgZEw
            gY4GA1UdEQSBhjCBg4IIYXRsYW50aXOCDmF0bGFudGlzLmxvY2FsgiJhdGxhbnRp
            cy5kZWZhdWx0LnN2Yy5jbHVzdGVyLmxvY2Fsgglsb2NhbGhvc3SCF3ByaXR1bmwu
            d2F5b2Z0aGVzeXMuY29tghN2cG4ud2F5b2Z0aGVzeXMuY29thwR/AAABhwSKxTD3
            MA0GCSqGSIb3DQEBCwUAA4IBAQAkz5a1uYXINXNc6Bur3vY9b0+nGdnKJgKbgBUm
            Z2YqgrqD+/luNUvF0RYoTGXhY9uwyyRJd35o2oz1HABxJLq+qbAGESkJ9bEi/yzv
            gM+hjd6CXB0Ee2oEa9o+BNbRCVoXaXspsimA3lcfVJoRw1fPy8f1FQTddT8KinEJ
            DHxB1GA7LF335DmMveWDQUhfBNlwKQMpq5JgUYpgQwhOA48YbaBCktNB+ET4Aglc
            jTrm5ZS1p10kVh80f8hFy6jGUWQtgt9pXz3I4sqIol5ZN+raIaPyH9dLxMLoU2Ij
            gn4ASWiat9DPW1KTwcLSygP66yUoMYzde1Kn4jLujE+vkL12
            -----END CERTIFICATE REQUEST-----
        EOT -> (known after apply)
      ~ dns_names        = [ # forces replacement
            # (5 unchanged elements hidden)
            "vpn.wayofthesys.com",
          + "loki.wayofthesys.com",
        ]
      ~ id               = "275d972cee237169ab91fb03f0b2179247de069d" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ subject {
          - street_address = [] -> null
            # (2 unchanged attributes hidden)
        }
    }

  # tls_locally_signed_cert.cert must be replaced
-/+ resource "tls_locally_signed_cert" "cert" {
      ~ cert_pem              = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIID1zCCAr+gAwIBAgIQIlVuKIcyy1KznXcue3cHODANBgkqhkiG9w0BAQsFADAl
            MRAwDgYDVQQKEwdQcml0dW5sMREwDwYDVQQDEwhjYS5sb2NhbDAeFw0yMjA0MjYw
            MTQ0MzJaFw0yMzA0MjYwMTQ0MzJaMDUxETAPBgNVBAoTCEF0bGFudGlzMSAwHgYD
            VQQDExdwcml0dW5sLndheW9mdGhlc3lzLmNvbTCCASIwDQYJKoZIhvcNAQEBBQAD
            ggEPADCCAQoCggEBAOZSQ2AJNIOAsZCQrumpoAgGdiEne677LrxiTT/ofwUv+jdV
            bQ8bjZv5FZFBkRyfoY4AyPIdHPAfVecybEFX/76IZWBQ388rIjBNIcHo8l4mj2nk
            jF9FWUVKlRgTRtPPzCMBp3KIBmrvEZOc16Be7QR4yDzJVOaDaKy0veTH5eRagv1M
            9pAETQXDzz6W6YJG/Wicpj4CEH/XJiKl6pV0HrDTLngsi5VzYMupPbmixOE5YoTV
            IVDoSqaU/jov4ygmPrbL+frrc6KT4piXm/dBPuX66MUQIyjJSdDFvtAx06rGQ9oJ
            5j8J2kWe98Jmt62TJlAq1nYDQgNnKL/4UkVMvBsCAwEAAaOB8jCB7zAOBgNVHQ8B
            Af8EBAMCAqQwHQYDVR0lBBYwFAYIKwYBBQUHAwIGCCsGAQUFBwMBMAwGA1UdEwEB
            /wQCMAAwHwYDVR0jBBgwFoAUiX7mn7B4BkrbgISk8XecJhMj9owwgY4GA1UdEQSB
            hjCBg4IIYXRsYW50aXOCDmF0bGFudGlzLmxvY2FsgiJhdGxhbnRpcy5kZWZhdWx0
            LnN2Yy5jbHVzdGVyLmxvY2Fsgglsb2NhbGhvc3SCF3ByaXR1bmwud2F5b2Z0aGVz
            eXMuY29tghN2cG4ud2F5b2Z0aGVzeXMuY29thwR/AAABhwSKxTD3MA0GCSqGSIb3
            DQEBCwUAA4IBAQCSJgkAuzC3NjVnZHzNfXdFrMioNgP2jvD/Z+yLXD4zCG76xYJ3
            vX85p3ExtVRC2FAiRQ1SnDOyjbQPJRYcU7ZtiN0P+ys3xBze1ibFXgSVYKq4nMsA
            NFruW0kBW+VVqFO2ZDM3pQFEXrpAcfHukogz1zmZG0JqhYQcyH72USz4ygYa+Mbu
            xzP6CD3CM9TekTuXx36TyRSHBsVSLDoz6EO2EDVtalYE8YV5PCyskEsfuKROypIA
            F9Is9zXXseGWgYCD6GDddBPP42Sbv0GhtbYdR+NVIG3F+VhnF5qopV1ZijCWs5hv
            YzBxB5iitvTl6V8LcUCm+J9fsTRC3oHJfrkW
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ cert_request_pem      = "eeb882857e3dd5f17782fd60ff61c2575b4828ee" -> (known after apply) # forces replacement
      ~ id                    = "45637331365687385064308654441313535800" -> (known after apply)
      ~ ready_for_renewal     = false -> true
      ~ validity_end_time     = "2023-04-26T01:44:32.385540215Z" -> (known after apply)
      ~ validity_start_time   = "2022-04-26T01:44:32.385540215Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 2 to destroy.

Warning: Version constraints inside provider configuration blocks are deprecated

  on providers.tf line 12, in provider "digitalocean":
  12:   version = ">=1.5.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.

Warning: Argument is deprecated

  with tls_self_signed_cert.ca-vpn,
  on tls-vpn.tf line 20, in resource "tls_self_signed_cert" "ca-vpn":
  20:   key_algorithm   = tls_private_key.ca-vpn.algorithm

This is now ignored, as the key algorithm is inferred from the
`private_key_pem`.

(and 11 more similar warnings elsewhere)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/atlantis`
* :put_litter_in_its_place: To **delete** this plan click [here](https://wayofthesys.com/lock?id=autotune%252Fpritunl-k8s-tf-do%252Fterraform%252Fatlantis%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/atlantis`
</details>
Plan: 2 to add, 3 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
